package learn.example.pile;


import com.google.gson.JsonArray;

import org.junit.Test;

import java.util.List;

import learn.example.pile.factory.CommentFactory;
import learn.example.pile.object.NetEase;


/**
 * To work on unit tests, switch the Test Artifact in the Build Variants view.
 */
public class ExampleUnitTest {

    public static final String json="{ 'urls':[{\"url\": " +
            "\"http://p3.pstatp.com/w356/78f002033060a15d691\"}, " +
            "{\"url\": \"http://pb2.pstatp.com/w356/78f002033060a15d691\"}, " +
            "{\"url\": \"http://pb3.pstatp.com/w356/78f002033060a15d691\"}]}";
    private JsonArray urls;

    @Test
    public void addition_isCorrect() {
        List list=CommentFactory.newInstance().produceNetEaseComment("{\"againstLock\":\"0\",\"audioLock\":\"1\",\"code\":\"1\",\"docUrl\":\"http://sports.163.com/16/0816/19/BUK7KDND00051C9U.html\",\"hotPosts\":[{\"1\":{\"a\":\"4\",\"b\":\"完完整整\uD83D\uDCAF年！\",\"bi\":\"sports2_bbs\",\"d\":\"BUK7KDND00051C9U\",\"f\":\"网易上海市手机网友&nbsp;上海恒诺： \",\"fi\":\"0\",\"ip\":\"118.132.*.*\",\"l\":\"0\",\"label\":\"[{\\\"endTime\\\":\\\"1445643087692\\\",\\\"startTime\\\":\\\"1445556687691\\\",\\\"tagKey\\\":\\\"100\\\"},{\\\"endTime\\\":\\\"1442517968453\\\",\\\"startTime\\\":\\\"1442431568452\\\",\\\"tagKey\\\":\\\"101\\\"},{\\\"endTime\\\":\\\"1444291661908\\\",\\\"startTime\\\":\\\"1444205261907\\\",\\\"tagKey\\\":\\\"102\\\"},{\\\"endTime\\\":\\\"1469251012950\\\",\\\"startTime\\\":\\\"1469164612949\\\",\\\"tagKey\\\":\\\"103\\\"},{\\\"endTime\\\":\\\"1448982048787\\\",\\\"startTime\\\":\\\"1448895648787\\\",\\\"tagKey\\\":\\\"104\\\"},{\\\"endTime\\\":\\\"1442679957672\\\",\\\"startTime\\\":\\\"1442593557671\\\",\\\"tagKey\\\":\\\"105\\\"}]\",\"n\":\"上海恒诺\",\"p\":\"2556486599\",\"pi\":\"BUK7KDND00051C9U_2556486599\",\"rp\":\"0\",\"source\":\"ph\",\"t\":\"2016-08-16 20:00:07\",\"timg\":\"http://img1.ph.126.net/DuS_ZC4Z9yOM6RZpcvjeLA==/6630055115490022429.jpg\",\"u\":\"5LwI6gS48yD6EKC8cVThetVVlICePgrXVZTuxuCn7Js%3D\",\"v\":\"2175\",\"vip\":\"\"}},{\"1\":{\"a\":\"1\",\"b\":\"一百年真的死而无憾了一路走好\uD83D\uDD6F愿在天堂里面您还能享受足球带来的快乐\",\"bi\":\"sports2_bbs\",\"d\":\"BUK7KDND00051C9U\",\"f\":\"网易陕西省咸阳市手机网友&nbsp;珠联合碧金枪消魂： \",\"fi\":\"0\",\"ip\":\"36.42.*.*\",\"l\":\"0\",\"label\":\"[{\\\"endTime\\\":\\\"1470715613034\\\",\\\"startTime\\\":\\\"1470629213033\\\",\\\"tagKey\\\":\\\"100\\\"},{\\\"endTime\\\":\\\"1471228282792\\\",\\\"startTime\\\":\\\"1471141882792\\\",\\\"tagKey\\\":\\\"101\\\"},{\\\"endTime\\\":\\\"1471404419372\\\",\\\"startTime\\\":\\\"1471318019372\\\",\\\"tagKey\\\":\\\"102\\\"},{\\\"endTime\\\":\\\"1471232057002\\\",\\\"startTime\\\":\\\"1471145657001\\\",\\\"tagKey\\\":\\\"103\\\"},{\\\"endTime\\\":\\\"1471400352019\\\",\\\"startTime\\\":\\\"1471313952018\\\",\\\"tagKey\\\":\\\"104\\\"},{\\\"endTime\\\":\\\"1471241768663\\\",\\\"startTime\\\":\\\"1471155368662\\\",\\\"tagKey\\\":\\\"105\\\"}]\",\"n\":\"珠联合碧金枪消魂\",\"p\":\"2556485713\",\"pi\":\"BUK7KDND00051C9U_2556485713\",\"rp\":\"0\",\"source\":\"ph\",\"t\":\"2016-08-16 19:58:59\",\"timg\":\"http://imgm.ph.126.net/F8cGbPHztXyFUMHDWrqY7g==/6631718676583210253.jpg\",\"u\":\"oW%2BOMdhdshjtz1Kf2Fwga3%2Fgc%2B5l5WdgolfGQhS19Qo%3D\",\"v\":\"1145\",\"vip\":\"viphy\"}},{\"1\":{\"a\":\"1\",\"b\":\"功大于过！\",\"bi\":\"sports2_bbs\",\"d\":\"BUK7KDND00051C9U\",\"f\":\"网易江苏省手机网友：\",\"fi\":\"0\",\"ip\":\"183.207.*.*\",\"l\":\"0\",\"p\":\"2556488213\",\"pi\":\"BUK7KDND00051C9U_2556488213\",\"rp\":\"0\",\"source\":\"ph\",\"t\":\"2016-08-16 20:01:10\",\"u\":\"JyUSn2W73BLm4FB4ukf5Ez2n54oEvnK8cHE2mGrx12%2FSXMkIPLXamKb8GyolYshzf%2BBz7mXlZ2CiV8ZCFLX1Cg%3D%3D\",\"v\":\"915\"}},{\"1\":{\"a\":\"0\",\"b\":\"明天就是鬼節，可今天閻羅王提前派黑白無常把他收了！\",\"bi\":\"sports2_bbs\",\"d\":\"BUK7KDND00051C9U\",\"f\":\"网易浙江省手机网友&nbsp;米老鼠日熊： \",\"fi\":\"0\",\"ip\":\"36.23.*.*\",\"l\":\"0\",\"label\":\"[{\\\"endTime\\\":\\\"1471320409396\\\",\\\"startTime\\\":\\\"1471234009396\\\",\\\"tagKey\\\":\\\"101\\\"},{\\\"endTime\\\":\\\"1471304558694\\\",\\\"startTime\\\":\\\"1471218158694\\\",\\\"tagKey\\\":\\\"102\\\"},{\\\"endTime\\\":\\\"1471434753698\\\",\\\"startTime\\\":\\\"1471348353698\\\",\\\"tagKey\\\":\\\"103\\\"},{\\\"endTime\\\":\\\"1471436634176\\\",\\\"startTime\\\":\\\"1471263834176\\\",\\\"tagKey\\\":\\\"104\\\"},{\\\"endTime\\\":\\\"1471414512983\\\",\\\"startTime\\\":\\\"1471328112982\\\",\\\"tagKey\\\":\\\"105\\\"}]\",\"n\":\"米老鼠日熊\",\"p\":\"2556503738\",\"pi\":\"BUK7KDND00051C9U_2556503738\",\"rp\":\"0\",\"source\":\"ph\",\"t\":\"2016-08-16 20:18:51\",\"timg\":\"http://imgm.ph.126.net/LQt8Fj4yaPX1PnBajX5Abg==/6631795642397845691.jpg\",\"u\":\"Ti4RIwHvCYKCNSiGHlA1oPpfq0c6a9qFfK1rXXsT8SM%3D\",\"ut\":\"榜上有名\",\"v\":\"429\",\"vip\":\"vipm\"}},{\"1\":{\"a\":\"1\",\"b\":\"走好，天堂没有足球。\",\"bi\":\"sports2_bbs\",\"d\":\"BUK7KDND00051C9U\",\"f\":\"网易北京市手机网友&nbsp;笑着拒绝： \",\"fi\":\"0\",\"ip\":\"61.148.*.*\",\"l\":\"0\",\"n\":\"笑着拒绝\",\"p\":\"2556488063\",\"pi\":\"BUK7KDND00051C9U_2556488063\",\"rp\":\"0\",\"source\":\"ph\",\"t\":\"2016-08-16 20:01:10\",\"timg\":\"http://imgm.ph.126.net/q33w45INUTTqdXegABVajQ==/6631311857280978860.jpg\",\"u\":\"7%2BJ7rgX0X9EU85ZEsnkVA5vo1Dvj4Xgn3tQ7o%2BIjgZE%3D\",\"v\":\"589\"}},{\"1\":{\"a\":\"0\",\"b\":\"走好咯！！生老病死本来就是自然规律，怎么叫不幸、推给大伙一个徴丄卝信：三益四散巴斯七，这是卖那些 罕二见 和 稀二有 的 宝一贝的\",\"bi\":\"sports2_bbs\",\"d\":\"BUK7KDND00051C9U\",\"f\":\"网易山东省潍坊市网友：\",\"fi\":\"0\",\"ip\":\"119.176.*.*\",\"l\":\"0\",\"n\":\"yznw96\",\"p\":\"2556558462\",\"pi\":\"BUK7KDND00051C9U_2556558462\",\"rp\":\"0\",\"source\":\"wb\",\"t\":\"2016-08-16 21:18:31\",\"timg\":\"\",\"u\":\"%2B8ufhFgI%2FuQV4YG15RE7QA%3D%3D\",\"v\":\"326\"}},{\"1\":{\"a\":\"0\",\"b\":\"100岁的老人，走了对足坛的巨大打击从何说起……哎！\",\"bi\":\"sports2_bbs\",\"d\":\"BUK7KDND00051C9U\",\"f\":\"网易四川省成都市手机网友：\",\"fi\":\"0\",\"ip\":\"171.221.*.*\",\"l\":\"0\",\"p\":\"2556528178\",\"pi\":\"BUK7KDND00051C9U_2556528178\",\"rp\":\"0\",\"source\":\"ph\",\"t\":\"2016-08-16 20:45:18\",\"u\":\"mzS9%2BM%2F6wsPaTUellMpQEqFJVm%2BrBbZd4Ltw9mV5WQA%3D\",\"v\":\"8\"},\"2\":{\"a\":\"1\",\"b\":\"估计你看球时间不长，布拉特就是靠他上来的，布拉特贪腐也是师承与他…他在国际足联的受贿丑闻不是一般的多…\",\"bi\":\"sports2_bbs\",\"d\":\"BUK7KDND00051C9U\",\"f\":\"网易广东省深圳市宝安区手机网友&nbsp;巴塞罗那： \",\"fi\":\"0\",\"ip\":\"116.25.*.*\",\"l\":\"0\",\"label\":\"[{\\\"endTime\\\":\\\"1472738619676\\\",\\\"startTime\\\":\\\"1470751419675\\\",\\\"tagKey\\\":\\\"100\\\"},{\\\"endTime\\\":\\\"1472649031506\\\",\\\"startTime\\\":\\\"1470748231504\\\",\\\"tagKey\\\":\\\"101\\\"},{\\\"endTime\\\":\\\"1472242496266\\\",\\\"startTime\\\":\\\"1470773696265\\\",\\\"tagKey\\\":\\\"102\\\"},{\\\"endTime\\\":\\\"1471470018086\\\",\\\"startTime\\\":\\\"1471210818086\\\",\\\"tagKey\\\":\\\"103\\\"},{\\\"endTime\\\":\\\"1471411973433\\\",\\\"startTime\\\":\\\"1471325573433\\\",\\\"tagKey\\\":\\\"104\\\"},{\\\"endTime\\\":\\\"1471407932106\\\",\\\"startTime\\\":\\\"1471321532105\\\",\\\"tagKey\\\":\\\"105\\\"}]\",\"n\":\"巴塞罗那\",\"p\":\"2556533299\",\"pi\":\"BUK7KDND00051C9U_2556533299\",\"rp\":\"0\",\"source\":\"ph\",\"t\":\"2016-08-16 20:50:22\",\"timg\":\"http://img2.ph.126.net/7JEGUaFY9_ruH_3GqcugtA==/6631673596607278484.jpg\",\"u\":\"YMhQhtiVUh9EM4Hsm8Vztvpfq0c6a9qFfK1rXXsT8SM%3D\",\"v\":\"390\"}},{\"1\":{\"a\":\"0\",\"b\":\"怎么他的名字离我很远远远远远\",\"bi\":\"sports2_bbs\",\"d\":\"BUK7KDND00051C9U\",\"f\":\"网易广东省汕尾市手机网友&nbsp;我不随是便的人： \",\"fi\":\"0\",\"ip\":\"59.35.*.*\",\"l\":\"0\",\"n\":\"我不随是便的人\",\"p\":\"2556488061\",\"pi\":\"BUK7KDND00051C9U_2556488061\",\"rp\":\"0\",\"source\":\"ph\",\"t\":\"2016-08-16 20:01:10\",\"u\":\"S8wQYS%2BjmYbR%2F5Y10eRTgvpfq0c6a9qFfK1rXXsT8SM%3D\",\"v\":\"141\"}},{\"1\":{\"a\":\"0\",\"b\":\"前辈走好！\",\"bi\":\"sports2_bbs\",\"d\":\"BUK7KDND00051C9U\",\"f\":\"网易北京市手机网友&nbsp;北京大学经济兼法律研究所常务副所长： \",\"fi\":\"0\",\"ip\":\"106.38.*.*\",\"l\":\"0\",\"label\":\"[{\\\"endTime\\\":\\\"1468571615369\\\",\\\"startTime\\\":\\\"1468485215367\\\",\\\"tagKey\\\":\\\"100\\\"},{\\\"endTime\\\":\\\"1463967683130\\\",\\\"startTime\\\":\\\"1463881283129\\\",\\\"tagKey\\\":\\\"101\\\"},{\\\"endTime\\\":\\\"1469262601735\\\",\\\"startTime\\\":\\\"1469176201735\\\",\\\"tagKey\\\":\\\"102\\\"},{\\\"endTime\\\":\\\"1471061845453\\\",\\\"startTime\\\":\\\"1470975445453\\\",\\\"tagKey\\\":\\\"103\\\"},{\\\"endTime\\\":\\\"1471324617075\\\",\\\"startTime\\\":\\\"1471238217075\\\",\\\"tagKey\\\":\\\"104\\\"},{\\\"endTime\\\":\\\"1471240423812\\\",\\\"startTime\\\":\\\"1471154023811\\\",\\\"tagKey\\\":\\\"105\\\"}]\",\"n\":\"北京大学经济兼法律研究所常务副所长\",\"p\":\"2556485424\",\"pi\":\"BUK7KDND00051C9U_2556485424\",\"rp\":\"0\",\"source\":\"ph\",\"t\":\"2016-08-16 19:58:22\",\"timg\":\"\",\"u\":\"GzxlAoYMUlBUiYrLDCNuTWCgPGQnQp15afRX24Ld%2FPDSXMkIPLXamKb8GyolYshzf%2BBz7mXlZ2CiV8ZCFLX1Cg%3D%3D\",\"v\":\"98\",\"vip\":\"vipm\"}},{\"1\":{\"a\":\"1\",\"b\":\"第一  虽然不认识  ←_←\",\"bi\":\"sports2_bbs\",\"d\":\"BUK7KDND00051C9U\",\"f\":\"网易江苏省南京市手机网友&nbsp;7a71dcf0dc481803a23b8954c00e6992： \",\"fi\":\"0\",\"ip\":\"121.237.*.*\",\"l\":\"0\",\"n\":\"7a71dcf0dc481803a23b8954c00e6992\",\"p\":\"2556487844\",\"pi\":\"BUK7KDND00051C9U_2556487844\",\"rp\":\"0\",\"source\":\"ph\",\"t\":\"2016-08-16 20:01:09\",\"u\":\"3%2BiQDLBHLgU0xMinvOnyS%2F3WoOnUUhQu2VfhFJgLBp3SXMkIPLXamKb8GyolYshzf%2BBz7mXlZ2CiV8ZCFLX1Cg%3D%3D\",\"v\":\"119\"}}],\"isTagOff\":\"0\"}");

    }




    public String scriptTag(String js)
    {
        return "<script src='"+js+"'>"+"</script>";
    }



    public static class UrlBean {
        private String url;

        public String getUrl() {
            return url;
        }

        public void setUrl(String url) {
            this.url = url;
        }
    }
}